<a href="https://colab.research.google.com/github/carloslizarragac/FisicaComputacional1/blob/master/Actividad3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd
import numpy as np

In [ ]:
# Creamos el DataFrame compra a partir de un diccionario data
data ={'manzanas':[3,2,0,1],'naranjas':[0,'',7,2]}
df_compras = pd.DataFrame(data)
df_compras

   manzanas naranjas
0         3        0
1         2
2         0        7
3         1        2

In [ ]:
# Creamos las personas que compran 
df_compras = pd.DataFrame(data, index=['Ana', 'Roberto', 'Lily', 'David'])
df_compras

         manzanas naranjas
Ana             3        0
Roberto         2
Lily            0        7
David           1        2

In [ ]:
# Podemos ver que compró Ana (selección del renglón con .loc)
df_compras.loc['Ana']

manzanas    3
naranjas    0
Name: Ana, dtype: int64

In [ ]:
df_compras.to_csv('compras.csv')

In [ ]:
# Pandas permite leer archivos csv, Excel y otros formatos
df_compras = pd.read_csv('https://github.com/ .... /compras.csv')

In [ ]:
df_compras.head(3)

  Unnamed: 0  manzanas  naranjas
0        Ana         3       0.0
1    Roberto         2       NaN
2       Lily         0       7.0

In [ ]:
df_compras.rename(columns={'Unnamed: 0': 'Nombre'}, inplace=True)

In [ ]:
df_compras.head()

    Nombre  manzanas  naranjas
0      Ana         3       0.0
1  Roberto         2       NaN
2     Lily         0       7.0
3    David         1       2.0

In [ ]:
df_compras.shape

(4, 3)

In [ ]:
df_compras.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    4 non-null      object
 1   manzanas  4 non-null      int64
 2   naranjas  3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 224.0+ bytes

In [ ]:
df_compras.describe()

       manzanas  naranjas
count  4.000000  3.000000
mean   1.500000  3.000000
std    1.290994  3.605551
min    0.000000  0.000000
25%    0.750000  1.000000
50%    1.500000  2.000000
75%    2.250000  4.500000
max    3.000000  7.000000

In [ ]:
df_compras['Nombre'].describe()

count        4
unique       4
top       Lily
freq         1
Name: Nombre, dtype: object

In [ ]:
df_compras.value_counts().head()

Nombre  manzanas  naranjas
Lily    0         7.0         1
David   1         2.0         1
Ana     3         0.0         1
dtype: int64

In [ ]:
df_compras.columns

Index(['manzanas', 'naranjas'], dtype='object')

In [ ]:
df_compras.columns = ['Names', 'apples', 'oranges']

In [ ]:
df_compras.columns

Index(['Names', 'apples', 'oranges'], dtype='object')

In [ ]:
df_compras.head()

    Nombre  manzanas  naranjas
0      Ana         3       0.0
1  Roberto         2       NaN
2     Lily         0       7.0
3    David         1       2.0

In [ ]:
df_compras.head()

     Names  apples  oranges
0      Ana       3      0.0
1  Roberto       2      NaN
2     Lily       0      7.0
3    David       1      2.0

In [27]:
from numpy.random import randn
df = pd.DataFrame(randn(6,4),index='0 1 2 3 4 5'.split(),columns='A B C D'.split())

In [32]:
df

          A         B         C         D
0 -1.564055  0.305034 -0.958470 -0.090069
1 -0.546921  2.114905 -0.870584 -0.683636
2 -1.047579 -0.255980 -0.511482  0.152245
3 -0.833513  0.248365  0.749542  1.139157
4  0.294051  0.137719  0.086907 -1.654086
5  0.164606  0.516558  1.524541  2.309395

In [33]:
# Imprime el tercer renglon '3' 
df.loc['3']

A   -0.833513
B    0.248365
C    0.749542
D    1.139157
Name: 3, dtype: float64

In [34]:
df.iloc[3]

A   -0.833513
B    0.248365
C    0.749542
D    1.139157
Name: 3, dtype: float64

In [35]:
# Imprime un elemento específico. 
df.loc['2', 'C']

-0.5114823621478797

In [36]:
df.loc['2':'4']

          A         B         C         D
2 -1.047579 -0.255980 -0.511482  0.152245
3 -0.833513  0.248365  0.749542  1.139157
4  0.294051  0.137719  0.086907 -1.654086

In [37]:
df.iloc[2:4]

          A         B         C         D
2 -1.047579 -0.255980 -0.511482  0.152245
3 -0.833513  0.248365  0.749542  1.139157

In [38]:
df.loc['0':'4','A':'B']

          A         B
0 -1.564055  0.305034
1 -0.546921  2.114905
2 -1.047579 -0.255980
3 -0.833513  0.248365
4  0.294051  0.137719

In [7]:
df>0.5

       A      B      C
0   True  False   True
1  False  False   True
2  False   True   True
3  False  False  False
4  False  False  False

In [39]:
df

          A         B         C         D
0 -1.564055  0.305034 -0.958470 -0.090069
1 -0.546921  2.114905 -0.870584 -0.683636
2 -1.047579 -0.255980 -0.511482  0.152245
3 -0.833513  0.248365  0.749542  1.139157
4  0.294051  0.137719  0.086907 -1.654086
5  0.164606  0.516558  1.524541  2.309395

In [40]:
df[df['B'] <= 0.25]

          A         B         C         D
2 -1.047579 -0.255980 -0.511482  0.152245
3 -0.833513  0.248365  0.749542  1.139157
4  0.294051  0.137719  0.086907 -1.654086

In [43]:
 df[(df['B'] <= 0.25) & (df['C'] >= 0.5)]

          A         B         C         D
3 -0.833513  0.248365  0.749542  1.139157

In [7]:
import numpy as np
df2 = pd.DataFrame({'A':[1,np.nan,3,4,np.nan,7,2,np.nan],
                  'B':[5,np.nan,6,5,7,2,np.nan,5],
                  'C':[5,3,6,5,7,2,8,5],
                  'D':[1,2,3,np.nan,5,np.nan,7,8]})

In [14]:
df2

     A    B  C    D
0  1.0  5.0  5  1.0
1  NaN  NaN  3  2.0
2  3.0  6.0  6  3.0
3  4.0  5.0  5  NaN
4  NaN  7.0  7  5.0
5  7.0  2.0  2  NaN
6  2.0  NaN  8  7.0
7  NaN  5.0  5  8.0

In [15]:
df2.dropna()

     A    B  C    D
0  1.0  5.0  5  1.0
2  3.0  6.0  6  3.0

In [16]:
df2.dropna(axis=1)

   C
0  5
1  3
2  6
3  5
4  7
5  2
6  8
7  5

In [8]:
df3=df2.fillna(value=0)

In [9]:
df3

     A    B  C    D
0  1.0  5.0  5  1.0
1  0.0  0.0  3  2.0
2  3.0  6.0  6  3.0
3  4.0  5.0  5  0.0
4  0.0  7.0  7  5.0
5  7.0  2.0  2  0.0
6  2.0  0.0  8  7.0
7  0.0  5.0  5  8.0

In [24]:
df3.iloc[2:4]

     A    B  C    D
2  3.0  6.0  6  3.0
3  4.0  5.0  5  0.0

In [25]:
df3.loc['2':'4']

     A    B  C    D
2  3.0  6.0  6  3.0
3  4.0  5.0  5  0.0
4  0.0  7.0  7  5.0

In [31]:
df3[df3['B'] == 5.0]

     A    B  C    D
0  1.0  5.0  5  1.0
3  4.0  5.0  5  0.0
7  0.0  5.0  5  8.0

In [40]:
df3[(df3['B'] == 5.0) & (df3['D'] < 2.0)]

     A    B  C    D
0  1.0  5.0  5  1.0
3  4.0  5.0  5  0.0

In [11]:
df4=df3[['B','C']]
df4

     B  C
0  5.0  5
1  0.0  3
2  6.0  6
3  5.0  5
4  7.0  7
5  2.0  2
6  0.0  8
7  5.0  5

In [10]:
import pandas as pd
#url = "https://github.com/carloslizarragac/FisicaComputacional1/blob/master/Actividad1/Guaymas26292.txt"
url="Guaymas26292.txt"
https://github.com/carloslizarragac/FisicaComputacional1/blob/master/Actividad1/Guaymas26292.txt
my_cols = ["Fecha", "Precip", "Evap", "Tmax", "Tmin"]
#df_dist = pd.read_csv("Guaymas26292.txt", names=my_cols, sep='\s+ | :', header=None, skiprows=19, skipfooter=2, engine='python')
df_dist = pd.read_csv(url, names=my_cols, sep='\s+ | :', header=None, skiprows=19, skipfooter=2, engine='python')
#lineterminator='\r'

In [11]:
df_dist.head()

        Fecha Precip  Evap Tmax Tmin
0  01/02/1967      0  Nulo   20    8
1  02/02/1967      0  Nulo   21    9
2  03/02/1967      0  Nulo   26    8
3  04/02/1967      0  Nulo   25    7
4  05/02/1967      0  Nulo   23    7